Tekla Open API Reference for Tekla Structures 2025
OBB.Equals Method (Object)
 Tests for the exact equality of two OBBs.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Object to compare.
Return Value
Type: Boolean
True if the OBBs are equal, otherwise false.
See Also
Reference
OBB Class
Equals Overload
Tekla.Structures.Geometry3d Namespace